<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"70c2b8f53b5567f2793cf4d2d0f0b84df6de7a292f29fda1e7a70ae1b3163684","plan_job_ref":"Job Terraform plan #22 at https://github.com/w00kster/mariokart-leaderboard/actions/runs/4889123135","plan_hash":"34d0f779d7b4df3f17adc27b5fda9178664dc733f203064a65e496a0ab2216fc","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __infrastructure/mysql/__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_database_mysql.mariokart-leaderboard will be created
  + resource "linode_database_mysql" "mariokart-leaderboard" {
      + allow_list       = [
          + "180.150.36.8/32",
          + "193.116.209.48/32",
          + "220.245.113.214/32",
        ]
      + ca_cert          = (sensitive value)
      + cluster_size     = 1
      + created          = (known after apply)
      + encrypted        = false
      + engine           = (known after apply)
      + engine_id        = "************"
      + host_primary     = (known after apply)
      + host_secondary   = (known after apply)
      + id               = (known after apply)
      + label            = "mariokart-leaderboard"
      + region           = "ap-southeast"
      + replication_type = "none"
      + root_password    = (sensitive value)
      + root_username    = (sensitive value)
      + ssl_connection   = true
      + status           = (known after apply)
      + type             = "g6-nanode-1"
      + updated          = (known after apply)
      + version          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #22](https://github.com/w00kster/mariokart-leaderboard/actions/runs/4889123135)